

[
  {
    "id": 1,
    "name_pt": "Montada",
    "belt": "branca",
    "image": "../../public/montada.webp",
    "video": "https://www.youtube.com/embed/vid01",
    "description_pt": "A montada é uma das posições mais dominantes do Jiu-Jitsu: quem está por cima senta-se sobre o peito/abdômen do adversário com os joelhos no chão e controla o tronco, quadril e cabeça do oponente. A partir da montada você tem acesso a uma grande variedade de finalizações (armbar, chave de braço, estrangulamentos) e transições, além de excelente controle para golpear em regras que permitem strikes. A eficiência da montada vem da distribuição de peso, do controle dos membros do oponente e da habilidade de ajustar a base para impedir reversões. Para iniciantes, a ênfase deve ser em estabilidade, controle de quadril e presença de ombro para neutralizar movimentos de ponte. Em níveis intermediários e avançados, trabalha-se montagem alta/baixa, montada reversa e ataques combinados.",
    "steps": [
      "Estabelecer postura segura após a passagem de guarda.",
      "Posicionar os pés no chão afastados na largura dos quadris e equilibrar o peso.",
      "Descer o centro de gravidade e pressionar os quadris no tronco do adversário.",
      "Controlar cabeça e um braço do oponente para limitar mobilidade.",
      "Ajustar os joelhos próximos às axilas para impedir ponte e rolamento.",
      "Procurar abertura para finalizações (braços, pescoço) ou transições de posição."
    ]
  },
  {
    "id": 2,
    "name_pt": "Arm Lock",
    "belt": "branca",
    "image": "../../public/armlock.jpg",
    "video": "https://www.youtube.com/embed/vid02",
    "description_pt": "O Arm Lock clássico (armbar) é uma finalização que hiperextende o cotovelo usando os quadris como alavanca. Pode ser aplicado a partir de diversas posições — guarda fechada, guarda montada, meia-guarda e montada. A chave do armbar eficaz é controlar o braço do oponente, posicionar o quadril próximo à articulação do cotovelo e girar o corpo para isolar o membro, colocando a perna sobre a cabeça ou costas para evitar que o oponente puxe o braço. Atenção com a segurança: aplique progressivamente e respeite sinais de dor. Técnicas avançadas incluem transições rápidas entre omoplata e armbar e armbar a partir de passagens de guarda.",
    "steps": [
      "Isolar o braço do adversário segurando pulso e bíceps.",
      "Girar o quadril de modo que o joelho entre em linha com o ombro do oponente.",
      "Colocar a perna contrária sobre a cabeça ou nuca para controlar a postura.",
      "Deitar as costas enquanto puxa o braço e posiciona o quadril sobre o cotovelo.",
      "Apertar os joelhos para evitar fuga e elevar o quadril lentamente para estender o cotovelo.",
      "Finalizar quando o oponente der tap ou apresentar resistência excessiva."
    ]
  },
  {
    "id": 3,
    "name_pt": "Chave de Panturrilha",
    "belt": "marrom",
    "image": "../../public/chavepanturrilha.jpg",
    "video": "https://www.youtube.com/embed/vid03",
    "description_pt": "A chave de panturrilha (calf slicer) é uma finalização compressiva aplicada na perna do adversário, pressionando a panturrilha ou a junção tíbio-fibular contra um antebraço, joelho ou canela. Apesar de menos comum em faixas iniciais, é muito eficaz em disputas de pernas e em situações de luta de solo onde o oponente tenta recuperar a posição. A técnica exige precisão na angulação e controle total do quadril do oponente para impedir rotação. Além de causar dor aguda na panturrilha, a compressão mal aplicada pode lesionar estruturas internas, por isso deve ser executada com controle e progressividade.",
    "steps": [
      "Isolar a perna do adversário em uma posição de perna presa ou entrapment.",
      "Alinhar seu antebraço/joelho contra a panturrilha do oponente, criando a superfície de compressão.",
      "Rolar ou girar o corpo para aumentar a pressão e impedir que o oponente alivie a tensão.",
      "Ajustar o ângulo do quadril para direcionar a força ao ponto de compressão.",
      "Aumentar gradualmente a pressão até o adversário bater (tap).",
      "Liberar de forma controlada após o tap para segurança."
    ]
  },
  {
    "id": 4,
    "name_pt": "Guarda Delariva",
    "belt": "azul",
    "image": "../../public/guarda_delariva.webp",
    "video": "https://www.youtube.com/embed/vid04",
    "description_pt": "A guarda De La Riva é uma guarda aberta em que o praticante prende uma das pernas ao redor do exterior da perna do adversário (gancho De La Riva) enquanto segura as mãos, lapela ou manga do parceiro para controlar sua postura e equilíbrio. É uma guarda altamente dinâmica utilizada para variações de raspagens, ataques de pernas e transições para guarda aranha ou guarda guarda-fechada. Exige mobilidade de quadril, controle de pegada e leitura do peso do adversário. De La Riva é ótima para neutralizar passadores e preparar ataques como entradas para ás de perna ou variações de triângulo quando o oponente se expõe.",
    "steps": [
      "Quando o adversário passa para a sua lateral, inserir o gancho De La Riva ao redor da perna externa dele.",
      "Estabelecer pegadas na manga, lapela ou calça para controlar mãos e postura.",
      "Manter o quadril móvel e alongar a perna livre para criar frames.",
      "Usar o gancho para desequilibrar e puxar a perna do passador.",
      "Executar variação de raspagem ou entrada para as pernas (ex.: single leg).",
      "Transicionar para outras guardas conforme a reação do adversário."
    ]
  },
  {
    "id": 5,
    "name_pt": "Guarda Fechada",
    "belt": "branca",
    "image": "../../public/guarda_fechada.jpg",
    "video": "https://www.youtube.com/embed/vid05",
    "description_pt": "A guarda fechada é uma posição fundamental do Jiu-Jitsu em que você está de costas no solo com as pernas fechadas ao redor do quadril do adversário, controlando-o e limitando seus movimentos. É uma base excelente para controlar, atacar com armlocks, triângulos, omoplatas e variações de raspagem. A eficiência da guarda fechada depende do controle de cabeça e braços do adversário, do ângulo que você cria com o corpo e da habilidade de abrir espaço usando quadris. Treinar postura, quebras de postura do adversário e combinações de ataque/transição é essencial para tirar máximo proveito dessa posição.",
    "steps": [
      "Puxar o adversário para perto e fechar as pernas ao redor do quadril dele.",
      "Controlar a postura do oponente segurando a manga, lapela ou nuca.",
      "Criar ângulos com o quadril para preparar ataques (giro de quadril).",
      "Procurar oportunidades para triângulo, armbar ou omoplata enquanto mantém controle.",
      "Executar raspagens quando o adversário se expõe ou perde o equilíbrio.",
      "Abrir a guarda apenas quando for vantajoso para transição ou finalização."
    ]
  },
  {
    "id": 6,
    "name_pt": "Guarda Borboleta",
    "belt": "azul",
    "image": "../../public/guarda_borboleta.jpg",
    "video": "https://www.youtube.com/embed/vid06",
    "description_pt": "A guarda borboleta é uma guarda sentada com ganchos debaixo das coxas do adversário (ganchos de borboleta) que permite variações de raspagem, variações de distância e controle de postura. É especialmente útil contra adversários maiores, pois permite criar alavancas com os ganchos para levantar e desequilibrar. A técnica favorece movimentos explosivos, trocas de pegada e raspagens laterais, além de transições para meia-guarda ou meia-guarda invertida. Trabalhar timing e sensibilidade das pegadas é essencial para uma borboleta eficiente.",
    "steps": [
      "Sentar-se em posição vertical com as costas retas e inserir um ou dois ganchos sob as coxas do oponente.",
      "Estabelecer controle das mangas ou do colarinho para limitar a postura.",
      "Usar os ganchos para elevar ou girar a base do adversário e criar espaço.",
      "Executar raspagens rodando por baixo e substituindo a posição por cima.",
      "Aproveitar as raspagens para subir para meia-guarda ou montada.",
      "Manter reatividade para não ser passado por pressão do oponente."
    ]
  },
  {
    "id": 7,
    "name_pt": "Kimura",
    "belt": "roxa",
    "image": "../../public/kimura.jpg",
    "video": "https://www.youtube.com/embed/vid07",
    "description_pt": "A Kimura é uma chave de ombro em que o praticante segura o pulso do adversário e cria uma alavanca em “L” envolvendo o braço com as mãos (empunhadura de Kimura). Pode ser aplicada a partir da guarda, meia-guarda, montada e em pé. A força aplicada rotaciona o ombro, causando dor e potencial lesão se não houver rendição. Além da finalização direta, a Kimura é uma ferramenta tática para controlar e transicionar, permitindo variações como Kimura para armlock, queda ou para passagem de guarda. Controle de pegadas e posicionamento do quadril são críticos para não perder a vantagem.",
    "steps": [
      "Isolar o braço do adversário segurando o pulso com uma mão.",
      "Passar a outra mão por trás do braço dele e segurar seu próprio pulso (pegada de Kimura).",
      "Tracionar o pulso do oponente em direção à sua própria cabeça enquanto bloqueia o braço com o quadril.",
      "Girar o corpo e ajustar os quadris para aumentar a alavanca sobre o ombro.",
      "Aplicar pressão controlada e constante até o tap ou até transicionar para outra técnica.",
      "Se o adversário resistir, usar a Kimura para desequilibrar e passar para posição superior."
    ]
  },
  {
    "id": 8,
    "name_pt": "Mata-leão",
    "belt": "roxa",
    "image": "../../public/mataleao.webp",
    "video": "https://www.youtube.com/embed/vid08",
    "description_pt": "O mata-leão, conhecido em inglês como rear naked choke, é um estrangulamento aplicado por trás do oponente com um braço ao redor do pescoço e a outra mão reforçando a pegada. É uma das finalizações mais efetivas porque ataca diretamente o fluxo sanguíneo (carótidas), levando o adversário à inconsciência rapidamente se aplicado corretamente. Dominar a pegada, o posicionamento dos cotovelos e o controle das costas do adversário são pontos-chave. Segurança é essencial: nunca aplicar força súbita sem controle; a pressão deve ser gradual até a rendição.",
    "steps": [
      "Assumir as costas do adversário com ganchos (pernas) entre as pernas dele.",
      "Passar um braço ao redor do pescoço do oponente e a outra mão por trás da cabeça.",
      "Ajustar a mão do braço que envolve o pescoço próxima ao cotovelo do outro braço (pegada de apoio).",
      "Apertar os ombros em direção ao pescoço e comprimir as carótidas com os antebraços.",
      "Abaixar o queixo do oponente com o outro braço para maximizar a eficiência.",
      "Manter controle dos ganchos até o tap e liberar de forma controlada."
    ]
  },
  {
    "id": 9,
    "name_pt": "Triângulo",
    "belt": "azul",
    "image": "../../public/triangulo.jpg",
    "video": "https://www.youtube.com/embed/vid09",
    "description_pt": "O triângulo é um estrangulamento onde você usa as pernas para formar um triângulo ao redor do pescoço e de um braço do adversário, comprimindo as artérias carótidas e causando rendição. Normalmente executado da guarda, exige boa flexibilidade, timing e controle do braço que fica dentro do triângulo. Para ser eficaz, é preciso puxar a cabeça do oponente para dentro do triângulo e ajustar o ângulo do quadril, cruzando e fechando as pernas, além de apertar o joelho sobre a panturrilha para impedir aberturas. Triângulos podem ser combinados com armlocks e raspagens para maior eficiência.",
    "steps": [
      "Da guarda, controlar a cabeça e o braço do adversário que ficará dentro do triângulo.",
      "Colocar uma perna por cima do ombro do oponente e a outra perna por trás do pescoço formando o ‘V’.",
      "Cruzar o pé por trás da panturrilha da outra perna e fechar o triângulo.",
      "Puxar a cabeça do adversário para dentro e girar o quadril para ajustar o ângulo.",
      "Apertar as pernas e empurrar o quadril para cima, comprimindo as artérias.",
      "Se necessário, transicionar para armlock ou ajustar até o tap."
    ]
  },
  {
    "id": 10,
    "name_pt": "Omoplata",
    "belt": "marrom",
    "image": "../../public/omoplata.jpg",
    "video": "https://www.youtube.com/embed/vid10",
    "description_pt": "A Omoplata é uma finalização de ombro que utiliza as pernas para torcer o braço do adversário em rotação externa, afetando a articulação do ombro. Frequentemente aplicada a partir da guarda fechada ou guarda aberta, também é usada como transição para variações de finalização ou para ganhar posições. Exige coordenação entre controle de pegadas, abertura de quadril e pressão com as pernas. Em competições, a omoplata pode ser convertida em estrangulamento, armbar ou raspagem, tornando-a uma técnica versátil e estratégica.",
    "steps": [
      "Isolar o braço do oponente em sua guarda enquanto controla o pulso.",
      "Girar o quadril e passar uma perna sobre o ombro do oponente, colocando a canela contra suas costas.",
      "Rodar o corpo para criar torque e sentar-se em direção ao lado do oponente.",
      "Descer o quadril e ajustar a perna para bloquear o tronco do adversário.",
      "Empurrar o quadril para frente enquanto puxa o braço do oponente para completar a rotação do ombro.",
      "Aumentar a pressão até o tap ou transicionar para outra finalização se necessário."
    ]
  },
  {
    "id": 11,
    "name_pt": "Passagem de Guarda",
    "belt": "azul",
    "image": "../../public/passage_de_guarda.jpg",
    "video": "https://www.youtube.com/embed/vid11",
    "description_pt": "A passagem de guarda conhecida como knee slice (fatiada de joelho) é uma técnica de passagem onde você corta a perna do adversário com o joelho, controlando quadril e tronco, para chegar à meia-guarda ou montada. É uma passagem de pressão que combina controle de grips, bloqueio de quadril e estabilização do corpo para impedir a recuperação da guarda. A eficiência depende de neutralizar as pernas do adversário, manter o peso direcionado ao quadril dele e progredir com paciência e precisão.",
    "steps": [
      "Controlar os grips do oponente (mangas, calças ou colarinho) para limitar movimento.",
      "Postar o joelho na linha média e direcionar o joelho em corte sobre a perna do adversário.",
      "Usar o ombro e mãos para controlar a cabeça e o quadril do oponente.",
      "Aplicar pressão com o joelho enquanto avança o corpo para a frente.",
      "Estabilizar a passagem substituindo a perna de corte e estabelecendo base baixa.",
      "Consolidar posição (meia-guarda ou montada) evitando armadilhas."
    ]
  },
  {
    "id": 12,
    "name_pt": "Raspagem de Gancho",
    "belt": "branca",
    "image": "../../public/raspagem_gancho.jpg",
    "video": "https://www.youtube.com/embed/vid12",
    "description_pt": "A raspagem de gancho simples (single hook sweep) tira proveito de um gancho de perna para desequilibrar o adversário e girar para cima, conseguindo a posição de montada ou lateral. É uma raspagem eficiente para iniciantes porque combina o uso dos quadris, alavanca e timing. A técnica exige coordenação entre puxada de braço/manga e elevação com o gancho, seguida de rotação do corpo. Bom controle das pegadas e leitura da base do adversário aumentam a taxa de sucesso dessa raspagem.",
    "steps": [
      "Estabelecer gancho (um pé sob a coxa do adversário) e controlar uma manga ou colarinho.",
      "Puxar o braço do oponente em direção ao seu peito para desequilibrá-lo.",
      "Elevar com o gancho e girar o quadril para rodar sob o adversário.",
      "Subir com o corpo enquanto remove o pé oposto para completar a raspagem.",
      "Finalizar a raspagem substituindo a posição para cima (montada/meia-guarda).",
      "Estabilizar e controlar o adversário após a raspagem."
    ]
  },
  {
    "id": 13,
    "name_pt": "Entrada de Perna",
    "belt": "marrom",
    "image": "../../public/ashi_garami.jpg",
    "video": "https://www.youtube.com/embed/vid13",
    "description_pt": "A entrada de perna em posições como Single Leg X ou Ashi Garami concentra-se em controlar uma das pernas do adversário enquanto se utiliza das pernas para prender e isolar. Essa posição é base para ataques de tornozelo, chave de calcanhar e raspagens. Requer compreensão de alavancas nas pernas, controle de postura e timing para evitar que o adversário recupere a base ou force a separação. Técnicas avançadas exploram transições rápidas para leglocks e variações de controle de perna interna/externa.",
    "steps": [
      "Capturar e segurar a perna do adversário enquanto controla a sua pegada na canela ou panturrilha.",
      "Entrar com a perna de gancho por trás e fechar a posição de Single Leg X/Ashi Garami.",
      "Controlar a postura do oponente e sua capacidade de rodar a perna presa.",
      "Procurar desalinhamento para aplicar chave no tornozelo ou calcanhar.",
      "Se a finalização não estiver disponível, usar para raspagens e transições.",
      "Liberar com controle se o adversário expor outra abertura."
    ]
  },
  {
    "id": 14,
    "name_pt": "Chave de Calcanhar",
    "belt": "preta",
    "image": "../../public/heelhook.jpg",
    "video": "https://www.youtube.com/embed/vid14",
    "description_pt": "A chave de calcanhar (heel hook) é uma finalização de perna altamente eficiente e potencialmente perigosa, que aplica torção ao tornozelo e ao joelho através do calcanhar. Devido ao risco de lesão grave, em muitos esportes e faixas inferiores a técnica é controlada ou proibida; quando permitida, exige extrema cautela e execução técnica. A chave de calcanhar ataca o ligamento colateral e estruturas internas do joelho ao girar a tíbia sobre o fêmur. Treinar progressivamente com supervisão e usar controle pode reduzir riscos. É uma ferramenta poderosa em leglock systems e em competições de submission-only.",
    "steps": [
      "Isolar a perna do adversário em posição apropriada (ex.: 50/50, outside sankaku).",
      "Capturar o calcanhar com as duas mãos e controlar a canela com as pernas para impedir fuga.",
      "Estabilizar o quadril e posicionar o corpo para aplicar torque.",
      "Rotacionar o calcanhar na direção que cria pressão no tornozelo/joelho.",
      "Aplicar força gradualmente e observar sinais de resistência do adversário.",
      "Parar imediatamente após o tap para evitar lesões."
    ]
  },
  {
    "id": 15,
    "name_pt": "Meia-guarda",
    "belt": "azul",
    "image": "../../public/meia_guarda.jpg",
    "video": "https://www.youtube.com/embed/vid15",
    "description_pt": "A meia-guarda é uma posição onde você tem uma perna entre as pernas do adversário e a outra perna presa sob a sua perna/oponente, oferecendo uma combinação de controle e opções de raspagem ou variação para recuperar a guarda completa. É muito utilizada por lutadores que preferem um jogo de controle mais próximo e transições para finalizações de perna e arm locks. Uma meia-guarda bem executada limita a pressão do passador e cria ângulos para raspagens que podem levar à montada ou às costas do adversário.",
    "steps": [
      "Colocar uma perna por dentro das pernas do adversário e a outra por baixo das pernas do mesmo.",
      "Controlar a manga ou o quadril para limitar a passagem.",
      "Usar o gancho de perna para elevar e criar espaço para raspagem.",
      "Executar raspagem direcionada substituindo a posição por cima.",
      "Procurar transição para guarda completa ou finalizações quando houver abertura.",
      "Manter o quadril móvel para evitar ser prensado."
    ]
  },
  {
    "id": 16,
    "name_pt": "Ezekiel Choke",
    "belt": "marrom",
    "image": "../../public/ezekiel.jpg",
    "video": "https://www.youtube.com/embed/vid16",
    "description_pt": "O estrangulamento Ezekiel é um choke tradicional do judô adaptado ao Jiu-Jitsu, que usa a manga ou o próprio antebraço para pressionar a traqueia do adversário, geralmente aplicado a partir da montada ou dentro da guarda quando se controla a cabeça. É uma finalização surpresa porque muitas vezes o braço que estrangula vem por dentro do colarinho do oponente. Exige coordenação da pega e posicionamento da cabeça para gerar pressão eficiente. Em regras que permitem esse choke, é uma ferramenta útil contra adversários que defendem bem outras finalizações.",
    "steps": [
      "Estabelecer controle da posição (ex.: montada ou dentro da guarda).",
      "Passar um braço por dentro do colarinho do oponente ou usar a manga para alcançar a traqueia.",
      "Colocar o outro braço por cima do primeiro para criar a alavanca.",
      "Ajustar o ajuste do pescoço e puxar o cotovelo por trás da cabeça do adversário.",
      "Aplicar pressão constante até o tap.",
      "Soltar imediatamente após o tap para segurança."
    ]
  },
  {
    "id": 17,
    "name_pt": "Passagem Stack",
    "belt": "roxa",
    "image": "../../public/stack_pass.jpg",
    "video": "https://www.youtube.com/embed/vid17",
    "description_pt": "A passagem stack é uma técnica de passagem de guarda que usa pressão vertical — empilhar o adversário levantando seus quadris em direção a cabeça — para desmontar os ganchos e abrir a guarda. Ao empilhar, você diminui a mobilidade das pernas do adversário, facilita o controle das pernas e cria espaço para cortar e estabelecer uma base de passagem. É muito eficaz contra guardas abertas e ganchos ativos, mas exige cuidado para não expor braços a kimuras ou omoplatas enquanto empilha.",
    "steps": [
      "Estabelecer grips nas pernas ou quadril do adversário para controlar a guarda.",
      "Levantar o quadril do oponente em direção à sua cabeça, empilhando-o sobre os ombros.",
      "Controlar as pernas e desfazer ganchos com a outra mão ou joelho.",
      "Avançar com a perna de corte para isolar uma perna e cortar a guarda.",
      "Assentar o peso e consolidar a passagem baixando o quadril.",
      "Estabelecer postura de controle superior e prevenir reversões."
    ]
  },
  {
    "id": 18,
    "name_pt": "Americana",
    "belt": "branca",
    "image": "../../public/americana.jpg",
    "video": "https://www.youtube.com/embed/vid18",
    "description_pt": "A Keylock, ou Americana, é uma chave de ombro que consiste em controlar o pulso e usar a outra mão para empurrar o cotovelo do adversário em rotação interna, causando pressão no ombro. É frequentemente aplicada quando se tem o controle lateral ou montada. A técnica é segura quando aplicada com progressão e controle, sendo uma boa ferramenta para iniciantes aprenderem o conceito de alavanca em articulações. A Keylock também é usada como setup para outras transições e para controlar o adversário no chão.",
    "steps": [
      "Isolar o braço do adversário com controle do pulso enquanto está na lateral ou montada.",
      "Passar a mão livre por baixo do cotovelo do adversário e segurar seu próprio pulso.",
      "Abaixar o cotovelo do oponente em direção ao seu corpo criando a alavanca.",
      "Manter os quadris estáveis e apertar a pegada até o tap.",
      "Se houver resistência, ajustar o ângulo do corpo para aumentar a alavanca.",
      "Liberar ao primeiro sinal de tap para segurança."
    ]
  },
  {
    "id": 19,
    "name_pt": "Raspagem de Quadril",
    "belt": "branca",
    "image": "../../public/hip_bump.jpg",
    "video": "https://www.youtube.com/embed/vid19",
    "description_pt": "A raspagem de quadril (hip bump sweep) é uma raspagem direta que usa a energia do quadril para derrubar o adversário quando ele se senta ou posta em cima de você. É uma raspagem simples e poderosa para principiantes porque depende mais de timing e explosão do que de complexas pegadas. Ao executar corretamente, você usa a elevação do tronco e o impacto do quadril para girar o adversário e completar a passagem para a montada.",
    "steps": [
      "Quando o adversário se posta em cima, envolver um braço na cintura dele e controlar a cabeça ou nuca.",
      "Explodir o quadril para cima e em direção ao lado do adversário para desequilibrá-lo.",
      "Empurrar com o braço prendendo a cintura enquanto rola para cima.",
      "Subir ao topo substituindo a posição por cima (normalmente montada).",
      "Estabilizar e controlar o oponente após a raspagem.",
      "Ajustar para finalizações se o adversário expuser braços ou pescoço."
    ]
  },
  {
    "id": 20,
    "name_pt": "Lapela Choke",
    "belt": "roxa",
    "image": "../../public/lapela_choke.jpg",
    "video": "https://www.youtube.com/embed/vid20",
    "description_pt": "O estrangulamento pela lapela explora o quimono (lapela) para criar um choke envolvendo o pescoço do adversário. Existem muitas variações — ex.: bolo wrap, fighter’s choke — e todas exigem habilidade com grips e manuseio da lapela. É uma técnica muito versátil em Jiu-Jitsu com quimono e combina bem com transições de guarda e ataques a partir das costas. A eficácia depende de como você controla a mão do adversário e posiciona a ponta da lapela na nuca ou atrás da cabeça para comprimir as carótidas.",
    "steps": [
      "Criar pegadas firmes na lapela do adversário com uma mão próxima ao pescoço.",
      "Passar a outra ponta da lapela por baixo do queixo ou por trás da cabeça conforme a variação.",
      "Cruzar as mãos ou ajustar a lapela para formar a alça que comprimirá as carótidas.",
      "Ajustar o posicionamento do corpo (ex.: costas, montada) para otimizar a pressão.",
      "Puxar as pontas da lapela com controle até o adversário bater (tap).",
      "Soltar imediatamente após o tap e verificar segurança."
    ]
  },
  {
    "id": 21,
    "name_pt": "Anaconda",
    "belt": "roxa",
    "image": "../../public/anaconda.jpg",
    "video": "https://www.youtube.com/embed/vid21",
    "description_pt": "O estrangulamento Anaconda é um choke de compressão e alavanca que normalmente surge a partir de entradas no solo quando você controla a cabeça e um braço do adversário. A técnica consiste em enlaçar o pescoço e o braço do oponente com os braços, girar o corpo e finalizar comprimindo as carótidas e aplicando torque através do tronco e quadril. É muito eficiente em transições de queda, scrambles e quando o oponente tenta pressionar por cima; permite tanto o tap por estrangulamento quanto a transição para posições de controle (por exemplo, para as costas ou para o mount). A execução segura requer controle firme do braço isolado, ajuste do ângulo do corpo para maximizar a alavanca e progressão lenta na pressão para evitar lesões. Em treinos e competições, a Anaconda é valorizada pela sua versatilidade — pode ser aplicada de joelho, da meia-guarda, ou até em pé após uma queda — e por oferecer múltiplas opções de finalização e controle.",
    "steps": [
      "Isolar a cabeça e o braço do adversário: controlar a nuca com uma mão enquanto puxa o braço oposto pela axila.",
      "Entrar o braço por baixo do pescoço do oponente e alcançar o próprio antebraço (formando a alça que envolverá pescoço e braço).",
      "Fechar a pegada (mão na mão) garantindo que seu antebraço pressione a lateral do pescoço do adversário.",
      "Girar o corpo na direção do braço isolado (normalmente rolando para o mesmo lado), colocando seu peito em direção ao tronco dele para aproximar os corpos.",
      "Descer o quadril e, se possível, controlar as pernas do oponente com os seus ganchos ou apontando os calcanhares no solo para evitar que ele role para escapar.",
      "Aplicar pressão progressiva: comprimir o antebraço contra a lateral do pescoço e usar o movimento de 'espremida + rolamento' do seu tronco/quadril para aumentar a pressão sobre as carótidas.",
      "Se o oponente tentar esticar o braço para escapar, usar essa abertura para apertar ainda mais a alça ou transicionar rapidamente para um Darce, Omoplata ou para as costas conforme a reação dele.",
      "Finalizar quando o adversário bater (tap) e soltar imediatamente; se em competição, consolidar a posição caso não haja tap e for seguro continuar."
    ]
  }
]